from random import randint # <----- χρησιμοποιειται αργοτερα για την τυχαια εμφανιση μιας λαθος ερωτησης στην περιπτωση που ο παιχτης καλεσει την 50-50

#Η ΕΚΤΕΤΑΜΕΝΗ ΧΡΗΣΗ WHILE ΓΙΝΕΤΑΙ ΜΕ ΣΚΟΠΟ ΤΗΝ ΑΠΟΤΡΟΠΗ ΑΠΑΝΤΗΣΕΩΝ ΠΕΡΑΝ ΑΥΤΩΝ ΠΟΥ ΠΡΟΒΛΕΠΟΝΤΑΙ(ΕΛΕΓΧΟΣ ΕΓΚΥΡΟΤΗΤΑΣ)

#class
class player:
    def __init__(self, name, score, ff, sq):
        self.name=name
        self.score=score
        self.ff=ff
        self.sq=sq
            
def skipquestion(players): #μέθοδος για την skip question όπου παραχωρείται η δυνατότητα σε κάθε παίχτη μία φορά να αφήσει μία ερώτηση και να του εμφανίσει άλλη στη θέση της
    (players).sq=False #η μέθοδος καλείται αν και μόνο αν δεν έχει ξαναχρησιμοποιηθεί αυτή η βοήθεια, μόλις κληθεί απενεργοποιείται για μελλοντική χρήση μέσω αυτής της εντολής
    print("The question for ", (players).name, "is: ", questions[10]) #εμφανίζει την εκφώνηση της ερώτησης
    print("a: ",possibleanswers[40], " b: ",possibleanswers[41]," c: ",possibleanswers[42]," d: ", possibleanswers[43]) #εμφάνιση πιθανών απαντήσεων
    while True:
        k=input("answer the question  ")
        if (k=="a") or (k=="b") or (k=="c") or (k=="d") or(k=="ff") or (k=="sq"): #καλύπτω κάθε πιθανό ενδεχόμενο που θα μπορούσε να απαντήσει ο παίχτης και διαβεβαιώνω πως δεν θα απαντησει κάτι που δεν προβλέπεται
            if(k==answers[10]): #αν απαντησει σωστα να του παραχωρήσει 10 πόντους
                print("Correct!")
                (players).score += 10
                break
            elif(k=="ff"): #η περιπτωση να επιλέξει να χρησιμοποιησει εδω περα την βοηθεια 50-50
                if((players).ff):
                    fiftyfifty(players) #καλεί τη μέθοδο 50-50
                    break
                else:
                    print("You have used the 50-50")
            elif(k=="sq"): #προφανως, για να εχει κληθει αυτη η μεθοδος, αυτο σημαινει οτι δεν θα μπορεσει να την ξανακαλεσει καθ'ολη τη διαρκεια του παιχνιδιου 
                print("You have used the skip question")
            else: #η περιπτωση να δωσει λαθος απαντηση
                print("wrong")
                break
        else: #η περιπτωση να μην δωσεις καμια απο τις προβλεπομενες απαντησεις
            print("this is not a valid choice. ")
            
def fiftyfifty(players):  #μέθοδος για την 50-50 η οποία παραχωρείται η δυνατότητα σε κάθε παίχτη να αποκλείσει 2 λάθος ερωτήσεις ώστε να μείνει 1 λαθος και 1 σωστή απάντηση
    (players).ff=False #η μέθοδος καλείται αν και μόνο αν δεν έχει ξαναχρησιμοποιηθεί αυτή η βοήθεια, μόλις κληθεί απενεργοποιείται για μελλοντική χρήση μέσω αυτής της εντολής
    n=randint(0,2) #θετω n έναν τυχαίο αριθμο μεταξύ 0 και 2 ωστε να επιλεγεί τυχαία(για λόγους τυχαιότητας) μία απο τις λάθος απαντήσεις απο το array στο οποίο είναι αποθηκευμένες οι λάθος απαντησεις η οποια ειναι η wronganswers και το array που περιεχει το αντιστοιχο γραμμα της λαθος απαντησεις το wronganswers1
    gramma=wronganswers1[3*i+n] #επιστρεφει τη θεση της τυχαια επιλεγμενης λαθος απαντησης το οποιο περιεχει το γραμμα
    erwthsh=wronganswers[3*i+n] #επιστρεφει τη θεση της τυχαια επιλεγμενης λαθος απαντησης το οποιο περιεχει το κειμενο
    print(answers[i],": ",answers1[i] ,"     ", gramma,": ",erwthsh) #εμφάνιση σωστης απαντησης και τυχαιας λαθος απαντησης
    while True:
        d=input("answer the question ")
        if (d==answers[i]) or (d==gramma) or (d=="sq"): #ο παιχτης θα απαντησει ή θα επιλεξει να αφησει την ερωτηση
            if(d==answers[i]): #αμα ο παιχτης απαντηση σωστα θα το παραχωρηθουν 10 ποντοι
                print("Correct!")
                (players).score += 10
                break
            elif(d=="sq"): #εφοσον δεν εχει χρησιμοποιησει προηγουμενως τη βοηθεια αυτη θα του εμφανισει την τελευταια ερωτηση
                if((players).sq):
                    skipquestion(players)
                    break
                else: #εαν την εχει χρησιμοποιησει ηδη θα του ζητηθει να δωσει αλλη απαντηση
                    print("You have used the skip question help ") 
            else: 
                print("wrong")
                break
        else:
            print("this is not a valid choice. ")
                
questions=["Πόσους νομούς έχει η Ελλάδα;", "Πρωτεύουσα του νομού Λασιθίου είναι…", "Το πιο ψηλό βουνό της Ελλάδας είναι ο Όλυμπος. Ποιο βρίσκεται στη 2η θέση;", "Η λίμνη Κερκίνη βρίσκεται…", "Ποια από τις παρακάτω πόλεις δεν βρίσκεται στην Πελοπόννησο;", "Ποιο είναι το μεγαλύτερο νησί των Επτανήσων;", "Πόσα κύρια νησιά περιλαμβάνει το σύμπλεγμα των Δωδεκανήσων;", "Σε ποιο ελληνικό νησί συναντάμε το έθιμο του σπασίματος της στάμνας την Ανάσταση;", "Ποιος νομός φημίζεται για το παστέλι του;", "Πρωτεύουσα των Κυκλάδων είναι η…","Ποιο είναι το μεγαλύτερο νησί της Ελλάδας;"]  #το array που περιέχει τις ερωτήσεις
possibleanswers=["49", "51", "54", "45", "Ο Άγιος Νικόλαος", "Η Σπιναλόγκα", "Η Σητεία", "Το Καρπενήσι", "Ο Παρνασσός", "Τα Λευκά Όρη","Ο Σμόλικας","Η Πίνδος", "Στη Ροδόπη", "Στη Φλώρινα", "Στις Σέρρες", "Στο Κιλκίς", "Η Αμαλιάδα", "Το Μεσολόγγι", "Η Καλαμάτα", "Η Πάτρα", "Η Λευκάδα","Η Κεφαλονία","Η Κέρκυρα", "Η Ιθάκη", "15", "12", "18", "10", "Στην Κρήτη", "Στην Σάμο", "Στην Κέρκυρα", "Στην Σκιάθο","Μαγνησίας","Μεσσηνίας", "Αργολίδας", "Ιωαννίνων", "Νάξος", "Μύκονος", "Ερμούπολη", "Ίος", "Η Ρόδος", "Η Κέρκυρα", "Η Εύβοια","Μύκονος"] #array Που περιεχει ολες τις πιθανες απαντησεις
wronganswers=["49", "54", "45", "Η Σπιναλόγκα", "Η Σητεία", "Το Καρπενήσι", "Ο Παρνασσός", "Τα Λευκά Όρη","Η Πίνδος", "Στη Ροδόπη", "Στη Φλώρινα", "Στο Κιλκίς", "Η Αμαλιάδα", "Η Καλαμάτα", "Η Πάτρα", "Η Λευκάδα", "Η Κέρκυρα", "Η Ιθάκη", "12", "18", "10", "Στην Κρήτη", "Στην Σάμο", "Στην Σκιάθο","Μαγνησίας","Αργολίδας", "Ιωαννίνων", "Νάξος", "Μύκονος", "Ίος", "Η Ρόδος", "Η Κέρκυρα", "Μύκονος"] #array που εχει το περιεχομενο των λαθος απαντησεων
wronganswers1=["a", "c", "d", "b", "c", "d", "a", "b","d", "a", "b", "d", "a", "c", "d", "a", "c", "d", "b", "c", "d", "a", "b", "d","a","c", "d", "a", "b", "d", "a", "b", "d"] #array Που περιεχει τα γραμματα των αντιστοιψων λαθος απαντησεων
answers1=["51", "Ο Άγιος Νικόλαος", "Ο Σμόλικας" , "Στις Σέρρες", "Το Μεσολόγγι", "Η Κεφαλονία", "15", "Στην Κέρκυρα", "Μεσσηνίας", "Ερμούπολη", "Η Εύβοια"] #array Που περιεχει τις σωστες απαντησεις
answers=["b", "a", "c", "c", "b", "b", "a", "c", "b", "c","c"] #array που περιεχει τα γραμματα των σωστων απαντησεων
print("Welcome to the game!!!! Rules are simple. You will each be asked a series of 10 questions. You have the right to use the 50-50 help once by typing ff, or the skip-question help(also once) by typing sq. Have fun!!!")
names = ["","",""] #αδειο array που θα γεμισει αργοτερα με τα ονοματα παιχτων
for i in range(0,3): #διαδικασια εγγραφης ονοματων των παιχτων
      c=input("Player Name: ")
      names[i]= c
player1=player(names[0],0, True,True) #αρχικοποιηση τιμων σε true
player2=player(names[1],0, True,True)
player3=player(names[2],0, True,True)
players=[player1,player2,player3]

for i in range(0,10): #αρχη του κυριου κωδικα για τη διαδικασια του παιχνιδιου 
    for j in range(0,3):
        print("The question for ", (players[j]).name, "is: ", questions[i]) #παρουσιαση ερωτησεων
        print("a: ",possibleanswers[(i*4)], " b: ",possibleanswers[i*4+1]," c: ",possibleanswers[i*4+2]," d: ", possibleanswers[i*4+3]) #παρουσιαση πιθανωων απαντησεων
        while True:
            c =str(input("answer, or request for help    "))
            if (c=="a") or (c=="b") or (c=="c") or (c=="d") or (c=="ff") or (c=="sq"): #οι πιθανες απαντησεις που μπορει να δωσει ο παιχτης
                if (c==answers[i]):
                    print("correct!!!")
                    (players[j]).score += 10
                    break
                elif (c=="ff"): #η περιπτωση να καλεσει την βοηθεια 50-50, καλειται μονο εαν δεν την εχει ξανακαλεσει
                    if((players[j]).ff):
                        fiftyfifty(players[j])
                        break
                    else:
                        print("You have used the 50-50")
                elif (c=="sq"): #η περιπτωση να καλεσει την βοηθεια skip question, καλειται μονο εαν δεν την εχει ξανακαλεσει
                    if((players[j]).sq):
                        skipquestion(players[j])
                        break
                    else:
                        print("You have used the skip question help")
                else:
                    print("wrong")
                    break
            else:
                print("This is not a valid choice, pick again. ")
                
for i in range(0,3): #επιβραβευση για την περιπτωση που δεν χρησιμοποιησουν καμια ή μια απτις δυο βοηθειες
    if (players[i].ff):
        players[i].score+=5
    if (players[i].sq):
        players[i].score+=5
        
scores=[player1.score,player2.score,player3.score] #array που περιεχει το σκορ του καθε παιχτη
scores.sort() #ταξινομηση 
max1=scores[2] #ευρεση μεγιστου στοιχειου
j=0

for i in range (0, 3): #ανακοινωση παιχτη/ων με το μεγαλυτερο σκορ 
    if ((players[i]).score==max1):
        print((players[i]).name , " is the Winner!!!")
        j=j+1
if (j>1):
    print(j, "players have tied. ")
        
    

